# StructuralConnectionSymbol Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..StructuralConnectionSymbol Property
ParameterTypeId Class See Also
---
"Connection Symbol"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId StructuralConnectionSymbol { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property StructuralConnectionSymbol As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ StructuralConnectionSymbol {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace